tutorials/multiphaseEuler/boilingBed/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phaseTurbulenceStabilisationGas
{
    type            phaseTurbulenceStabilisation;
    libs            ("libmultiphaseEulerFvModels.so");
    phase           gas;
    alphaInversion  0.1;
}

phaseTurbulenceStabilisationLiquid
{
    type            phaseTurbulenceStabilisation;
    libs            ("libmultiphaseEulerFvModels.so");
    phase           liquid;
    alphaInversion  0.1;
}

bedHeat
{
    type            semiImplicitSource;

    cellZone        bed;

    volumeMode      absolute;

    sources
    {
        e.solid
        {
            explicit
            {
                type            scale;
                value           2.3e4;
                scale
                {
                    type            linearRamp;
                    start           0.05;
                    duration        0.1;
                }
            }

            implicit        0;
        }
    }
}

heatTransferLimitedPhaseChange
{
    type            heatTransferLimitedPhaseChange;
    libs            ("libmultiphaseEulerFvModels.so");

    phases          (liquid gas);

    energySemiImplicit yes;
    pressureImplicit yes;

    saturationTemperature
    {
        type            function1;
        function
        {
            type            table;
            format          csv;
            nHeaderLine     1;
            units           ([bar] [K]);
            columns         (1 0);
            mergeSeparators no;
            file            "constant/water-saturation.csv";
            outOfBounds     clamp;
            interpolationScheme linear;
        }
    }
}

wallBoiling
{
    type            wallBoiling;

    libs            ("libmultiphaseEulerFvModels.so");

    phases          (liquid gas);

    energySemiImplicit no;

    saturationTemperature
    {
        $../../heatTransferLimitedPhaseChange/saturationTemperature;
    }

    partitioningModel
    {
        type            Lavieville;
        alphaCrit       0.2;
    }

    nucleationSiteModel
    {
        type            LemmertChawla;
        Cn              1;
        NRef            30000000;
        deltaTRef       10;
    }

    departureDiameterModel
    {
        type            TolubinskiKostanchuk;
        dRef            0.00024;
        dMax            0.0014;
        dMin            1e-06;
    }

    departureFrequencyModel
    {
        type            KocamustafaogullariIshii;
        Cf              1.18;
    }
}

solidSurfaceBoiling
{
    type            phaseSurfaceBoiling;

    libs            ("libmultiphaseEulerFvModels.so");

    phase           solid;
    phases          (liquid gas);

    energySemiImplicit no;

    saturationTemperature
    {
        $../../heatTransferLimitedPhaseChange/saturationTemperature;
    }

    partitioningModel
    {
        type            Lavieville;
        alphaCrit       0.2;
    }

    nucleationSiteModel
    {
        type            LemmertChawla;
    }

    departureDiameterModel
    {
        type            TolubinskiKostanchuk;
    }

    departureFrequencyModel
    {
        type            KocamustafaogullariIshii;
        Cf              1.18;
    }
}


// ************************************************************************* //
